{"backend": "tensorflow", "keras_version": "2.1.6-tf", "config": {"name": "model", "output_layers": [["outputs", 0, 0]], "input_layers": [["Input", 0, 0]], "layers": [{"name": "Input", "config": {"name": "Input", "dtype": "float32", "batch_input_shape": [null, 784], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "dense", "config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense", "use_bias": true, "activity_regularizer": null, "activation": "relu", "dtype": "float32", "trainable": true, "units": 512}, "class_name": "Dense", "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"name": "dense_1", "config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "activation": "relu", "dtype": "float32", "trainable": true, "units": 256}, "class_name": "Dense", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"name": "dense_2", "config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "use_bias": true, "activity_regularizer": null, "activation": "relu", "dtype": "float32", "trainable": true, "units": 256}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_3", "use_bias": true, "activity_regularizer": null, "activation": "relu", "dtype": "float32", "trainable": true, "units": 512}, "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "outputs", "config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "name": "outputs", "use_bias": true, "activity_regularizer": null, "activation": "softmax", "dtype": "float32", "trainable": true, "units": 10}, "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}]}, "class_name": "Model"}